# Examples I
Let's see some assorted SQL query examples. If you feel like it, try to write them on your own.

But first of all, let's create a connection and import the `sql` extension to be able to use *magics*.

In [2]:
import sqlalchemy
engine = sqlalchemy.create_engine('postgresql://bob:1234@localhost:5432/dvdrental')
engine.execution_options(isolation_level="AUTOCOMMIT")
%load_ext sql
%sql $engine.url

'Connected: bob@dvdrental'

1. How many payment transactions were greater thatn $7.00?

In [14]:
%%sql
SELECT count(*)
FROM payment
WHERE amount > 7;

 * postgresql://bob:***@localhost:5432/dvdrental
1 rows affected.

[(1406,)]

2. How many actors have a first name that starts with the letter **P**?

In [18]:
%%sql
SELECT count(*)
FROM actor
WHERE first_name LIKE 'P%';

 * postgresql://bob:***@localhost:5432/dvdrental
1 rows affected.

[(5,)]

3. How many unique districts are our customers from?

In [29]:
%%sql
SELECT count(DISTINCT district) 
FROM address;

 * postgresql://bob:***@localhost:5432/dvdrental
1 rows affected.

[(378,)]

4. Retrieve the list of names of the distinct districts in the previous question, limiting the list to the first 5 ones that start with the letter **B**.

In [37]:
%%sql
SELECT DISTINCT district
FROM address
WHERE district LIKE 'B%'
LIMIT 5;

 * postgresql://bob:***@localhost:5432/dvdrental
5 rows affected.

[('Baden-Wrttemberg',),
 ('Bchar',),
 ('Bursa',),
 ('British Colombia',),
 ('Botosani',)]

5. How many films have a rating of R and a replacement cost between $5 and $15?

In [41]:
%%sql
SELECT count(*)
FROM film
WHERE replacement_cost BETWEEN 5 AND 15
AND rating = 'R';

 * postgresql://bob:***@localhost:5432/dvdrental
1 rows affected.

[(52,)]

6. How many films have the word **Truman** somewhere in the title?

In [43]:
%%sql
SELECT count(*)
FROM film
WHERE title ILIKE '%truman%';

 * postgresql://bob:***@localhost:5432/dvdrental
1 rows affected.

[(5,)]